cases/fullSimulationExample/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(-1.075 -4.04 -1.515)
	(14.075 -4.04 -1.515)
	(14.075 4.04 -1.515)
	(-1.075 4.04 -1.515)
	(-1.075 -4.04 1.515)
	(14.075 -4.04 1.515)
	(14.075 4.04 1.515)
	(-1.075 4.04 1.515)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (150 80 30) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	inlet
	{
		type	patch;
		faces	(
			(0 4 7 3)
		);
	}
	outlet
	{
		type	patch;
		faces	(
			(2 6 5 1)
		);
	}
	boundaries
	{
		type	patch;
		faces	(
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);